<?php
/*
Template Name: Контакты и доставка
*/
get_header();
?>

<div class="filters__menu-anchor"></div>

<section class="filters">
    <div class="container">
        <div class="filters__row row">
            <div class="filters__buttons">
                <button class="filters__search">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.75 12.75L18.75 18.75M7.75 14.75C3.88401 14.75 0.75 11.616 0.75 7.75C0.75 3.88401 3.88401 0.75 7.75 0.75C11.616 0.75 14.75 3.88401 14.75 7.75C14.75 11.616 11.616 14.75 7.75 14.75Z" stroke="#131B2D" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                    </svg>
                </button>

                <button class="filters__sort">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.46429 14.8929L4.60714 18.75M4.60714 18.75L0.75 14.8929M4.60714 18.75V0.75M11.0357 4.60714L14.8929 0.75M14.8929 0.75L18.75 4.60714M14.8929 0.75V18.75" stroke="#131B2D" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                    </svg>
                </button>
            </div>

            <ul class="filters__menu js-filters-scroll">
                <li><a href="<?php echo esc_url( home_url( '/#pizza' ) ); ?>" class="filters__menu-item js-filters-link">Пицца</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#pizza-50' ) ); ?>" class="filters__menu-item js-filters-link">Пицца 50/50</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#roll' ) ); ?>" class="filters__menu-item js-filters-link">Роллы</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#set' ) ); ?>" class="filters__menu-item js-filters-link">Сеты</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#pasta' ) ); ?>" class="filters__menu-item js-filters-link">Лапша</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#snack' ) ); ?>" class="filters__menu-item js-filters-link">Закуски</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#salad' ) ); ?>" class="filters__menu-item js-filters-link">Салаты</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#dessert' ) ); ?>" class="filters__menu-item js-filters-link">Десерты</a></li>
                <li><a href="<?php echo esc_url( home_url( '/#drink' ) ); ?>" class="filters__menu-item js-filters-link">Напитки</a></li>
            </ul>

            <div class="swiper-btn js-filters-controls">
                <button class="swiper-btn-prev js-filters-prev" disabled tabindex="-1" aria-label="Previous slide" aria-disabled="true">
                    <svg width="27" height="17" viewBox="0 0 27 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M1.5 8.5L8.16667 15.5M1.5 8.5L8.16667 1.5M1.5 8.5H25.5" stroke="#131B2D" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                </button>

                <button class="swiper-btn-next js-filters-next" tabindex="0" aria-label="Next slide" aria-disabled="false">
                    <svg width="27" height="17" viewBox="0 0 27 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M25.5 8.5L18.8333 1.5M25.5 8.5L18.8333 15.5M25.5 8.5H1.5" stroke="#131B2D" stroke-width="3" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                </button>
            </div>

            <button class="filters__basket basketJS decs">
                <svg width="24" height="30" viewBox="0 0 24 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M17 20C15.8954 20 15 20.8954 15 22C15 23.1046 15.8954 24 17 24C18.1046 24 19 23.1046 19 22C19 20.8954 18.1046 20 17 20ZM17 20H9.29395C8.83288 20 8.60193 20 8.41211 19.918C8.24466 19.8456 8.09938 19.7291 7.99354 19.5805C7.8749 19.414 7.82719 19.1913 7.73274 18.7505L5.27148 7.26465C5.17484 6.81363 5.12587 6.58838 5.00586 6.41992C4.90002 6.27135 4.75477 6.15441 4.58732 6.08205C4.39746 6 4.16779 6 3.70653 6H3M6 9H18.8732C19.595 9 19.9555 9 20.1978 9.15036C20.41 9.28206 20.5653 9.48862 20.633 9.729C20.7104 10.0034 20.611 10.35 20.411 11.0435L19.0264 15.8435C18.9068 16.2581 18.8469 16.465 18.7256 16.6189C18.6185 16.7547 18.4772 16.861 18.317 16.9263C18.1361 17 17.9211 17 17.4921 17H7.73047M8 24C6.89543 24 6 23.1046 6 22C6 20.8954 6.89543 20 8 20C9.10457 20 10 20.8954 10 22C10 23.1046 9.10457 24 8 24Z" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                </svg>
                <div class="filters__basket-line"></div>
                <div class="filters__basket-price">1000₽</div>
            </button>
        </div>
    </div>
</section>

<section class="contact">
    <div class="container">
        <div class="contact__row row">
            <div class="contact__title">
                <div class="contact__title-line"></div>
                <h1 class="title">Контакты и доставка</h1>
                <div class="contact__title-line"></div>
            </div>

            <div class="contact__info">
                <div class="contact__leaf-left">
                    <img src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-svg.png' ); ?>" alt="">
                </div>

                <div class="contact__info-text">
                    <span style="font-weight: 700;">Режим работы доставки</span>
                    <span>ПН-ВС 10:00-00:00</span>
                    <a href="tel:550015">55-00-15</a>
                    <span>
                        Стоимость и время рассчитываются индивидуально в зависимости от того, в какой из трех зон находится адрес доставки.
                        <br>
                        Доставка бесплатная на пиццы от 33 см. В отдаленные районы города +50-100 к заказу. Минимальная сумма доставки на закуски, роллы, салаты и вок 1500₽.
                    </span>
                </div>

                <div class="contact__leaf-right">
                    <img src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-svg.png' ); ?>" alt="">
                </div>
            </div>

            <div class="contact__bottom">
                <div class="contact__bottom-left">
                    <div class="contact__bottom-leaf">
                        <img src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-bottom-svg.png' ); ?>" alt="">
                    </div>

                    <h2 class="subtitle">Точки продаж</h2>

                    <div class="contact__address">
                        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.75 3.75V18.75M12.75 3.75L18.75 0.75V15.75L12.75 18.75M12.75 3.75L6.75 0.75M12.75 18.75L6.75 15.75M6.75 15.75L0.75 18.75V3.75L6.75 0.75M6.75 15.75V0.75" stroke="#AF3A3A" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        <div class="contact__address-right">
                            <span class="text">г. Курск</span>
                            <button class="open-map text" data-address="Курск, пр-т Дериглазова, 19"><span>пр-т Дериглазова, 19</span></button>
                            <button class="open-map text" data-address="Курск, пр-т Хрущева, 1Б"><span>пр-т Хрущева, 1Б</span></button>
                            <button class="open-map text" data-address="Курск, пр-т Кулакова, 7"><span>пр-т Кулакова, 7</span></button>
                        </div>
                    </div>

                    <div class="contact__item">
                        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M7.50229 2.25722C7.19857 1.4979 6.46318 1 5.64539 1H2.89469C1.84828 1 1 1.8481 1 2.89453C1 11.7892 8.21059 19 17.1051 19C18.1515 19 18.9995 18.1516 18.9995 17.1052L19 14.354C19 13.5362 18.5022 12.8009 17.7429 12.4971L15.1066 11.4429C14.4245 11.1701 13.648 11.2929 13.0836 11.7632L12.4032 12.3307C11.6086 12.9929 10.4394 12.9402 9.70797 12.2088L7.79205 10.2911C7.06063 9.55963 7.00658 8.39134 7.66877 7.59669L8.23614 6.9163C8.70642 6.35196 8.83029 5.57516 8.55747 4.89309L7.50229 2.25722Z" stroke="#AF3A3A" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                        <a class="text" href="tel:550015">55-00-15</a>
                    </div>

                    <div class="contact__item">
                        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10 5V10H15M10 19C5.02944 19 1 14.9706 1 10C1 5.02944 5.02944 1 10 1C14.9706 1 19 5.02944 19 10C19 14.9706 14.9706 19 10 19Z" stroke="#AF3A3A" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                        <span class="text">Сегодня с 10:00 до 21:30</span>
                    </div>
                </div>

                <div class="contact__bottom-middle">
                    <h2 class="subtitle">Соц сети</h2>

                    <a href="#" class="contact__social">
                        <div class="contact__social-circle">
                            <svg width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M11.9622 9.52173C11.9507 10.1236 11.7608 10.7085 11.4165 11.2024C11.0722 11.6962 10.5891 12.0767 10.0283 12.2956C9.46753 12.5145 8.85438 12.562 8.26658 12.4321C7.67878 12.3021 7.14279 12.0006 6.72656 11.5657C6.31033 11.1308 6.03259 10.5821 5.92855 9.98915C5.82452 9.39621 5.89887 8.78574 6.14218 8.23511C6.38549 7.68447 6.78681 7.21848 7.29527 6.89619C7.80372 6.5739 8.39642 6.40982 8.99822 6.42476C9.79793 6.45438 10.5547 6.7943 11.108 7.37244C11.6613 7.95058 11.9677 8.72149 11.9622 9.52173Z" fill="#191919" />
                                <path d="M14.1529 0H3.84555C2.82565 0 1.84752 0.405155 1.12634 1.12634C0.405155 1.84752 0 2.82565 0 3.84555V14.3847C0 14.8897 0.0994675 15.3898 0.292725 15.8563C0.485982 16.3229 0.769244 16.7468 1.12634 17.1039C1.48343 17.461 1.90736 17.7443 2.37392 17.9375C2.84049 18.1308 3.34055 18.2303 3.84555 18.2303H14.1529C14.6579 18.2303 15.158 18.1308 15.6246 17.9375C16.0911 17.7443 16.515 17.461 16.8721 17.1039C17.2292 16.7468 17.5125 16.3229 17.7058 15.8563C17.899 15.3898 17.9985 14.8897 17.9985 14.3847V3.86455C18.0005 3.35809 17.9025 2.85621 17.7102 2.38768C17.5179 1.91915 17.235 1.49317 16.8778 1.13416C16.5205 0.775157 16.0959 0.490176 15.6284 0.295555C15.1608 0.100933 14.6594 0.000496017 14.1529 0ZM8.99829 14.6735C7.97793 14.6966 6.97386 14.415 6.1142 13.8649C5.25454 13.3148 4.57829 12.521 4.17176 11.5848C3.76522 10.6487 3.64684 9.61264 3.83171 8.60891C4.01659 7.60518 4.49634 6.6793 5.20974 5.94942C5.92314 5.21955 6.83783 4.71879 7.83708 4.51106C8.83633 4.30332 9.87481 4.39803 10.82 4.7831C11.7652 5.16816 12.5742 5.82612 13.1438 6.673C13.7134 7.51988 14.0178 8.51727 14.018 9.53788C14.0263 10.2049 13.903 10.8669 13.6551 11.4862C13.4071 12.1055 13.0395 12.6698 12.5733 13.1468C12.107 13.6238 11.5513 14.0042 10.9378 14.2662C10.3244 14.5282 9.66529 14.6666 8.99829 14.6735ZM14.5766 4.40414C14.4512 4.40417 14.3271 4.37918 14.2115 4.33064C14.0959 4.28209 13.9912 4.21097 13.9034 4.12144C13.8157 4.03191 13.7467 3.92577 13.7004 3.80923C13.6542 3.69269 13.6317 3.5681 13.6342 3.44276C13.6342 3.18778 13.7355 2.94325 13.9158 2.76295C14.0961 2.58266 14.3406 2.48137 14.5956 2.48137C14.8506 2.48137 15.0951 2.58266 15.2754 2.76295C15.4557 2.94325 15.557 3.18778 15.557 3.44276C15.5608 3.57849 15.5352 3.71343 15.482 3.83834C15.4287 3.96326 15.3492 4.07519 15.2487 4.16649C15.1481 4.25779 15.0291 4.3263 14.8997 4.36731C14.7702 4.40833 14.6335 4.4209 14.4987 4.40414H14.5766Z" fill="#191919" />
                            </svg>
                        </div>
                        <p class="text">INST</p>
                    </a>

                    <a href="#" class="contact__social">
                        <div class="contact__social-circle">
                            <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.26 1.26C2.38419e-07 2.532 0 4.566 0 8.64V9.36C0 13.428 2.38419e-07 15.462 1.26 16.74C2.532 18 4.566 18 8.64 18H9.36C13.428 18 15.462 18 16.74 16.74C18 15.468 18 13.434 18 9.36V8.64C18 4.572 18 2.538 16.74 1.26C15.468 2.38419e-07 13.434 0 9.36 0H8.64C4.572 0 2.538 2.38419e-07 1.26 1.26ZM3.036 5.478H5.1C5.166 8.91 6.678 10.362 7.878 10.662V5.478H9.816V8.436C10.998 8.31 12.246 6.96 12.666 5.472H14.598C14.4404 6.24222 14.1256 6.97167 13.6735 7.61481C13.2213 8.25796 12.6414 8.80099 11.97 9.21C12.7194 9.58287 13.3813 10.1104 13.9118 10.7579C14.4424 11.4053 14.8297 12.1579 15.048 12.966H12.918C12.462 11.544 11.322 10.44 9.816 10.29V12.966H9.576C5.472 12.966 3.132 10.158 3.036 5.478Z" fill="#191919" />
                            </svg>
                        </div>
                        <p class="text">VK</p>
                    </a>

                    <a href="#" class="contact__social">
                        <div class="contact__social-circle">
                            <svg width="20" height="17" viewBox="0 0 16 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M13.5127 0.0880988C13.698 0.010092 13.9009 -0.016812 14.1001 0.0101867C14.2994 0.0371854 14.4878 0.1171 14.6457 0.241613C14.8036 0.366125 14.9252 0.530684 14.9979 0.718161C15.0707 0.905638 15.0918 1.10918 15.0592 1.3076L13.3582 11.6253C13.1932 12.6206 12.1012 13.1913 11.1884 12.6956C10.4249 12.2808 9.29092 11.6418 8.27092 10.9751C7.76092 10.6413 6.19867 9.5726 6.39067 8.8121C6.55567 8.16185 9.18067 5.71835 10.6807 4.2656C11.2694 3.69485 11.0009 3.3656 10.3057 3.8906C8.57917 5.1941 5.80717 7.17635 4.89067 7.73435C4.08217 8.22635 3.66067 8.31035 3.15667 8.22635C2.23717 8.07335 1.38442 7.83635 0.688416 7.5476C-0.252084 7.1576 -0.206334 5.8646 0.687666 5.4881L13.5127 0.0880988Z" fill="#191919" />
                            </svg>
                        </div>
                        <p class="text">TG</p>
                    </a>

                    <img class="contact__bottom-middle-svg" src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-mobile-leaf.png' ); ?>" alt="">
                </div>

                <div class="contact__bottom-right">
                    <div class="contact__more">
                        <div class="contact__more-circle">
                            <svg width="32" height="24" viewBox="0 0 32 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_2068_255)">
                                    <mask id="mask0_2068_255" style="mask-type:luminance" maskUnits="userSpaceOnUse" x="0" y="0" width="32" height="24">
                                        <path d="M32 20C32 22.209 30.209 23.9998 28 24H4C1.79086 24 6.44267e-08 22.2091 0 20V7.5791H32V20ZM3.96289 10.7363C3.41076 10.7363 2.96314 11.1843 2.96289 11.7363V16.0527C2.96297 16.6049 3.41066 17.0527 3.96289 17.0527H9.66699C10.219 17.0525 10.6669 16.6048 10.667 16.0527V11.7363C10.6667 11.1844 10.2189 10.7366 9.66699 10.7363H3.96289ZM24.7031 14.5264C24.151 14.5265 23.7031 14.9742 23.7031 15.5264V16.0527C23.7032 16.6049 24.151 17.0526 24.7031 17.0527H28.0371C28.5891 17.0525 29.037 16.6048 29.0371 16.0527V15.5264C29.0371 14.9742 28.5892 14.5266 28.0371 14.5264H24.7031ZM17.5928 10.7363C17.0406 10.7363 16.593 11.1843 16.5928 11.7363V12.2627C16.5928 12.815 17.0405 13.2627 17.5928 13.2627H28.0361C28.5884 13.2627 29.0361 12.815 29.0361 12.2627V11.7363C29.0359 11.1843 28.5883 10.7363 28.0361 10.7363H17.5928ZM28 0C30.209 0.000190687 32 1.79098 32 4V5.05273H0V4C2.57706e-07 1.79086 1.79086 0 4 0H28Z" fill="white" />
                                    </mask>
                                    <g mask="url(#mask0_2068_255)">
                                        <path d="M0 7.5791V-1.4209H-9V7.5791H0ZM32 7.5791H41V-1.4209H32V7.5791ZM2.96289 11.7363L-6.03711 11.7322V11.7363H2.96289ZM2.96289 16.0527H-6.03711V16.0541L2.96289 16.0527ZM9.66699 17.0527V26.0527H9.67124L9.66699 17.0527ZM10.667 16.0527L19.667 16.054V16.0527H10.667ZM10.667 11.7363H19.667V11.7322L10.667 11.7363ZM9.66699 10.7363L9.67125 1.73633H9.66699V10.7363ZM24.7031 14.5264V5.52637H24.701L24.7031 14.5264ZM23.7031 16.0527H14.7031V16.0539L23.7031 16.0527ZM24.7031 17.0527L24.701 26.0527H24.7031V17.0527ZM28.0371 17.0527V26.0527H28.0412L28.0371 17.0527ZM29.0371 16.0527L38.0371 16.0539V16.0527H29.0371ZM28.0371 14.5264L28.0412 5.52637H28.0371V14.5264ZM16.5928 11.7363L7.59277 11.7322V11.7363H16.5928ZM29.0361 11.7363H38.0361V11.7322L29.0361 11.7363ZM32 5.05273V14.0527H41V5.05273H32ZM0 5.05273H-9V14.0527H0V5.05273ZM32 20H23C23 17.2377 25.239 15.0002 27.9992 15L28 24V33C35.1781 32.9994 41 27.1804 41 20H32ZM28 24L27.9992 15H4V24V33H28V24ZM4 24V15C6.76142 15 9 17.2386 9 20H0H-9C-9 27.1797 -3.1797 33 4 33V24ZM0 20H9V7.5791H0H-9V20H0ZM0 7.5791V16.5791H32V7.5791V-1.4209H0V7.5791ZM32 7.5791H23V20H32H41V7.5791H32ZM3.96289 10.7363V1.73633C-1.56389 1.73633 -6.03459 6.21689 -6.03711 11.7322L2.96289 11.7363L11.9629 11.7404C11.9609 16.1516 8.38541 19.7363 3.96289 19.7363V10.7363ZM2.96289 11.7363H-6.03711V16.0527H2.96289H11.9629V11.7363H2.96289ZM2.96289 16.0527L-6.03711 16.0541C-6.0363 21.5745 -1.56122 26.0527 3.96289 26.0527V17.0527L3.9629 8.05273C8.38253 8.05274 11.9622 11.6354 11.9629 16.0514L2.96289 16.0527ZM3.96289 17.0527V26.0527H9.66699V17.0527V8.05273H3.9629L3.96289 17.0527ZM9.66699 17.0527L9.67124 26.0527C15.1876 26.0501 19.6662 21.5786 19.667 16.054L10.667 16.0527L1.66699 16.0514C1.66764 11.631 5.25044 8.05482 9.66274 8.05274L9.66699 17.0527ZM10.667 16.0527H19.667V11.7363H10.667H1.66699V16.0527H10.667ZM10.667 11.7363L19.667 11.7322C19.6645 6.21282 15.1903 1.73894 9.67125 1.73633L9.66699 10.7363L9.66274 19.7363C5.24755 19.7342 1.66901 16.156 1.66699 11.7404L10.667 11.7363ZM9.66699 10.7363V1.73633H3.96289V10.7363V19.7363H9.66699V10.7363ZM24.7031 14.5264L24.701 5.52637C19.1821 5.52769 14.7031 10.0015 14.7031 15.5264H23.7031H32.7031C32.7031 19.9469 29.1198 23.5253 24.7053 23.5264L24.7031 14.5264ZM23.7031 15.5264H14.7031V16.0527H23.7031H32.7031V15.5264H23.7031ZM23.7031 16.0527L14.7031 16.0539C14.7039 21.5766 19.1809 26.0514 24.701 26.0527L24.7031 17.0527L24.7053 8.05273C29.1211 8.05378 32.7025 11.6331 32.7031 16.0515L23.7031 16.0527ZM24.7031 17.0527V26.0527H28.0371V17.0527V8.05273H24.7031V17.0527ZM28.0371 17.0527L28.0412 26.0527C33.5577 26.0502 38.0364 21.5785 38.0371 16.0539L29.0371 16.0527L20.0371 16.0515C20.0377 11.6311 23.6206 8.05474 28.033 8.05274L28.0371 17.0527ZM29.0371 16.0527H38.0371V15.5264H29.0371H20.0371V16.0527H29.0371ZM29.0371 15.5264H38.0371C38.0371 9.99961 33.5566 5.52887 28.0412 5.52637L28.0371 14.5264L28.033 23.5264C23.6218 23.5244 20.0371 19.9489 20.0371 15.5264H29.0371ZM28.0371 14.5264V5.52637H24.7031V14.5264V23.5264H28.0371V14.5264ZM17.5928 10.7363V1.73633C12.066 1.73633 7.5953 6.21689 7.59277 11.7322L16.5928 11.7363L25.5928 11.7404C25.5908 16.1516 22.0153 19.7363 17.5928 19.7363V10.7363ZM16.5928 11.7363H7.59277V12.2627H16.5928H25.5928V11.7363H16.5928ZM16.5928 12.2627H7.59277C7.59277 17.7855 12.0699 22.2627 17.5928 22.2627V13.2627V4.2627C22.0111 4.2627 25.5928 7.84442 25.5928 12.2627H16.5928ZM17.5928 13.2627V22.2627H28.0361V13.2627V4.2627H17.5928V13.2627ZM28.0361 13.2627V22.2627C33.559 22.2627 38.0361 17.7855 38.0361 12.2627H29.0361H20.0361C20.0361 7.84442 23.6179 4.2627 28.0361 4.2627V13.2627ZM29.0361 12.2627H38.0361V11.7363H29.0361H20.0361V12.2627H29.0361ZM29.0361 11.7363L38.0361 11.7322C38.0336 6.21689 33.5629 1.73633 28.0361 1.73633V10.7363V19.7363C23.6136 19.7363 20.0382 16.1516 20.0361 11.7404L29.0361 11.7363ZM28.0361 10.7363V1.73633H17.5928V10.7363V19.7363H28.0361V10.7363ZM28 0L27.9992 9C25.239 8.99976 23 6.76231 23 4H32H41C41 -3.18036 35.1789 -8.99938 28.0008 -9L28 0ZM32 4H23V5.05273H32H41V4H32ZM32 5.05273V-3.94727H0V5.05273V14.0527H32V5.05273ZM0 5.05273H9V4H0H-9V5.05273H0ZM0 4H9C9 6.76142 6.76143 9 4 9V0V-9C-3.1797 -9 -9 -3.1797 -9 4H0ZM4 0V9H27.9992L28 0L28.0008 -9H4V0Z" fill="#FB0106" />
                                    </g>
                                </g>
                                <defs>
                                    <clipPath id="clip0_2068_255">
                                        <rect width="32" height="24" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <p class="text">Мы принимаем оплату картой</p>
                    </div>

                    <div class="contact__more">
                        <div class="contact__more-circle">
                            <svg width="34" height="26" viewBox="0 0 34 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.77778 2.71429L13.6358 10.621L13.6394 10.6239C14.8451 11.4765 15.4482 11.903 16.1089 12.0678C16.6929 12.2134 17.3067 12.2134 17.8906 12.0678C18.5519 11.9029 19.1568 11.4751 20.3646 10.621C20.3646 10.621 27.329 5.46733 31.2222 2.71429M1 19.5146V6.48605C1 4.56587 1 3.60506 1.38753 2.87165C1.72842 2.22652 2.27195 1.7024 2.94097 1.37369C3.70155 1 4.69794 1 6.68924 1H27.3115C29.3028 1 30.297 1 31.0576 1.37369C31.7266 1.7024 32.272 2.22652 32.6128 2.87165C33 3.60435 33 4.56399 33 6.48042V19.5204C33 21.4368 33 22.3951 32.6128 23.1278C32.272 23.7729 31.7266 24.298 31.0576 24.6267C30.2978 25 29.304 25 27.3166 25H6.6834C4.69599 25 3.7008 25 2.94097 24.6267C2.27195 24.298 1.72842 23.7729 1.38753 23.1278C1 22.3944 1 21.4348 1 19.5146Z" stroke="#AF3A3A" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                            </svg>
                        </div>
                        <p class="text">
                            Предложения и сотрудничество: <br>
                            <a href="mailto:izabel.gafonova@yandex.ru">izabel.gafonova@yandex.ru</a>
                        </p>
                    </div>
                </div>
            </div>

            <div class="footer__bottom">
                <iframe src="https://yandex.ru/map-widget/v1/?lang=ru_RU&amp;scroll=true&amp;source=constructor-api&amp;um=constructor%3A0c40550a95135dbb55f8499a0515f271c6d291131313cdf6bad8aaa1d173c847" frameborder="0" allowfullscreen="true" width="100%" height="458px" style="display: block;"></iframe>
            </div>
        </div>
    </div>

    <img class="contact__back-left decs" src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-leaf-left.png' ); ?>" alt="">
    <img class="contact__back-right decs" src="<?php echo esc_url( get_template_directory_uri() . '/assets/image/contact-leaf-right.png' ); ?>" alt="">
</section>

<?php get_footer(); ?>